## Terraform Plan (Staging)

```hcl
data.aws_caller_identity.current: Reading...
data.aws_subnets.private: Reading...
data.aws_vpc.caselaw: Reading...
data.aws_region.current: Reading...
module.document_cleanser_ecr.data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=eu-west-2]
data.aws_caller_identity.current: Read complete after 0s [id=626206937213]
module.document_cleanser_ecr.data.aws_caller_identity.current: Read complete after 1s [id=626206937213]
data.aws_subnets.private: Read complete after 1s [id=eu-west-2]
data.aws_subnet.private["subnet-0a1227080a78cdfaa"]: Reading...
data.aws_subnet.private["subnet-01d6f2f6b913d940b"]: Reading...
data.aws_subnet.private["subnet-0f2d117e98a6020fe"]: Reading...
data.aws_subnet.private["subnet-0f2d117e98a6020fe"]: Read complete after 0s [id=subnet-0f2d117e98a6020fe]
data.aws_subnet.private["subnet-01d6f2f6b913d940b"]: Read complete after 0s [id=subnet-01d6f2f6b913d940b]
data.aws_subnet.private["subnet-0a1227080a78cdfaa"]: Read complete after 0s [id=subnet-0a1227080a78cdfaa]
data.aws_vpc.caselaw: Read complete after 2s [id=vpc-03fcb436542154949]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role_policy_attachment.lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_kms_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_kms_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_s3_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_s3_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_s3_bucket_notification.document_processing will be created
  + resource "aws_s3_bucket_notification" "document_processing" {
      + bucket      = "tna-caselaw-unpublished-assets-staging"
      + eventbridge = false
      + id          = (known after apply)
      + region      = "eu-west-2"

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_suffix       = ".docx"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_suffix       = ".pdf"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # aws_security_group.vpc_endpoints will be created
  + resource "aws_security_group" "vpc_endpoints" {
      + arn                    = (known after apply)
      + description            = "Security group for VPC endpoints used by document cleanser Lambda"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "HTTPS from VPC CIDR (includes Lambda in private subnets)"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "document-lambda-vpc-endpoints-"
      + owner_id               = (known after apply)
      + region                 = "eu-west-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "ManagedBy" = "terraform"
          + "Name"      = "document-lambda-vpc-endpoints-sg"
          + "Note"      = "TODO: Move to main VPC infrastructure"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
      + tags_all               = {
          + "ManagedBy" = "terraform"
          + "Name"      = "document-lambda-vpc-endpoints-sg"
          + "Note"      = "TODO: Move to main VPC infrastructure"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
      + vpc_id                 = "vpc-03fcb436542154949"
    }

  # aws_vpc_endpoint.ecr_api will be created
  + resource "aws_vpc_endpoint" "ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:DescribeRepositories",
                          + "ecr:ListImages",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + region                = "eu-west-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-2.ecr.api"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-01d6f2f6b913d940b",
          + "subnet-0a1227080a78cdfaa",
          + "subnet-0f2d117e98a6020fe",
        ]
      + tags                  = {
          + "ManagedBy" = "terraform"
          + "Name"      = "document-lambda-ecr-api-endpoint"
          + "Note"      = "TODO: Move to main VPC infrastructure"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Name"      = "document-lambda-ecr-api-endpoint"
          + "Note"      = "TODO: Move to main VPC infrastructure"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-03fcb436542154949"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.ecr_dkr will be created
  + resource "aws_vpc_endpoint" "ecr_dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + region                = "eu-west-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-2.ecr.dkr"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-01d6f2f6b913d940b",
          + "subnet-0a1227080a78cdfaa",
          + "subnet-0f2d117e98a6020fe",
        ]
      + tags                  = {
          + "ManagedBy" = "terraform"
          + "Name"      = "document-lambda-ecr-dkr-endpoint"
          + "Note"      = "TODO: Move to main VPC infrastructure"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Name"      = "document-lambda-ecr-dkr-endpoint"
          + "Note"      = "TODO: Move to main VPC infrastructure"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-03fcb436542154949"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.logs will be created
  + resource "aws_vpc_endpoint" "logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + region                = "eu-west-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-2.logs"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-01d6f2f6b913d940b",
          + "subnet-0a1227080a78cdfaa",
          + "subnet-0f2d117e98a6020fe",
        ]
      + tags                  = {
          + "ManagedBy" = "terraform"
          + "Name"      = "document-lambda-logs-endpoint"
          + "Note"      = "TODO: Move to main VPC infrastructure"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Name"      = "document-lambda-logs-endpoint"
          + "Note"      = "TODO: Move to main VPC infrastructure"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-03fcb436542154949"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.document_cleanser_ecr.aws_ecr_lifecycle_policy.repository_policy will be created
  + resource "aws_ecr_lifecycle_policy" "repository_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire images older than 7 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + region      = "eu-west-2"
      + registry_id = (known after apply)
      + repository  = "document-cleanser-lambda"
    }

  # module.document_cleanser_ecr.aws_ecr_repository.repository will be created
  + resource "aws_ecr_repository" "repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "document-cleanser-lambda"
      + region               = "eu-west-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "ImageSource" = "https://github.com/nationalarchives/da-caselaw-document-processing"
          + "ManagedBy"   = "terraform"
          + "Project"     = "da-caselaw-document-processing"
          + "Service"     = "document-cleanser-lambda"
        }
      + tags_all             = {
          + "ImageSource" = "https://github.com/nationalarchives/da-caselaw-document-processing"
          + "ManagedBy"   = "terraform"
          + "Project"     = "da-caselaw-document-processing"
          + "Service"     = "document-cleanser-lambda"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.document_cleanser_ecr.aws_ecr_repository_policy.repository_policy will be created
  + resource "aws_ecr_repository_policy" "repository_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:BatchGetImage",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:PutImage",
                          + "ecr:UploadLayerPart",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "626206937213",
                            ]
                        }
                      + Sid       = "AllowPushPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region      = "eu-west-2"
      + registry_id = (known after apply)
      + repository  = "document-cleanser-lambda"
    }

  # module.document_cleanser_lambda.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.document_cleanser_lambda.aws_cloudwatch_log_group.lambda_log_group will be created
  + resource "aws_cloudwatch_log_group" "lambda_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/document-cleanser-lambda"
      + name_prefix       = (known after apply)
      + region            = "eu-west-2"
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "ManagedBy" = "terraform"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
      + tags_all          = {
          + "ManagedBy" = "terraform"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
    }

  # module.document_cleanser_lambda.aws_iam_policy.vpc_access_policy[0] will be created
  + resource "aws_iam_policy" "vpc_access_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allows access to the VPC for function document-cleanser-lambda"
      + id               = (known after apply)
      + name             = "document-cleanser-lambda-vpc-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.document_cleanser_lambda.aws_iam_role.lambda_iam_role will be created
  + resource "aws_iam_role" "lambda_iam_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "document-cleanser-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.document_cleanser_lambda.aws_iam_role_policy_attachment.vpc_access_policy_attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_access_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "document-cleanser-lambda-role"
    }

  # module.document_cleanser_lambda.aws_lambda_function.lambda_function_ecr[0] will be created
  + resource "aws_lambda_function" "lambda_function_ecr" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Lambda function to strip author metadata from documents (DOCX, PDF, etc.)"
      + function_name                  = "document-cleanser-lambda"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "ManagedBy" = "terraform"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
      + tags_all                       = {
          + "ManagedBy" = "terraform"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "PRIVATE_ASSET_BUCKET" = "tna-caselaw-unpublished-assets-staging"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = [
              + "subnet-01d6f2f6b913d940b",
              + "subnet-0a1227080a78cdfaa",
              + "subnet-0f2d117e98a6020fe",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # module.document_cleanser_lambda.aws_lambda_permission.lambda_permissions["s3.amazonaws.com"] will be created
  + resource "aws_lambda_permission" "lambda_permissions" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "document-cleanser-lambda"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + region              = "eu-west-2"
      + source_arn          = "arn:aws:s3:::tna-caselaw-unpublished-assets-staging"
      + statement_id        = (known after apply)
      + statement_id_prefix = "AllowExecutionFromS3"
    }

  # module.document_cleanser_security_group.aws_security_group.security_group will be created
  + resource "aws_security_group" "security_group" {
      + arn                    = (known after apply)
      + description            = "Security group for document cleanser Lambda - AWS services via VPC endpoints only (no internet)"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "document-cleanser-lambda-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "ManagedBy" = "terraform"
          + "Name"      = "document-cleanser-lambda-sg"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
      + tags_all               = {
          + "ManagedBy" = "terraform"
          + "Name"      = "document-cleanser-lambda-sg"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
      + vpc_id                 = "vpc-03fcb436542154949"
    }

  # module.document_cleanser_security_group.aws_vpc_security_group_egress_rule.egress_rules[0] will be created
  + resource "aws_vpc_security_group_egress_rule" "egress_rules" {
      + arn                    = (known after apply)
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + prefix_list_id         = "pl-7ca54015"
      + region                 = "eu-west-2"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 443
    }

  # module.kms_access_policy.aws_iam_policy.iam_policy will be created
  + resource "aws_iam_policy" "iam_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allows document cleanser Lambda to decrypt unpublished assets bucket"
      + id               = (known after apply)
      + name             = "document-cleanser-lambda-kms-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                          + "kms:GenerateDataKey",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "kms:ViaService" = "s3.eu-west-2.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:kms:eu-west-2:626206937213:key/00e4ee30-be84-448d-80e9-ace54c7ee9bb",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "ManagedBy" = "terraform"
          + "Name"      = "document-cleanser-lambda-kms-access"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
      + tags_all         = {
          + "ManagedBy" = "terraform"
          + "Name"      = "document-cleanser-lambda-kms-access"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
    }

  # module.s3_access_policy.aws_iam_policy.iam_policy will be created
  + resource "aws_iam_policy" "iam_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allows document cleanser Lambda to access unpublished assets bucket"
      + id               = (known after apply)
      + name             = "document-cleanser-lambda-s3-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:GetObjectTagging",
                          + "s3:PutObject",
                          + "s3:PutObjectTagging",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::tna-caselaw-unpublished-assets-staging/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "ManagedBy" = "terraform"
          + "Name"      = "document-cleanser-lambda-s3-access"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
      + tags_all         = {
          + "ManagedBy" = "terraform"
          + "Name"      = "document-cleanser-lambda-s3-access"
          + "Project"   = "da-caselaw-document-processing"
          + "Service"   = "document-cleanser-lambda"
        }
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + availability_zones        = [
      + "eu-west-2a",
      + "eu-west-2b",
      + "eu-west-2c",
    ]
  + ecr_repository_arn        = (known after apply)
  + ecr_repository_url        = (known after apply)
  + kms_access_policy_arn     = (known after apply)
  + lambda_execution_role_arn = (known after apply)
  + lambda_function_arn       = (known after apply)
  + lambda_function_name      = "document-cleanser-lambda"
  + lambda_log_group_name     = "/aws/lambda/document-cleanser-lambda"
  + lambda_security_group_id  = (known after apply)
  + private_subnets_used      = [
      + "subnet-01d6f2f6b913d940b",
      + "subnet-0a1227080a78cdfaa",
      + "subnet-0f2d117e98a6020fe",
    ]
  + s3_access_policy_arn      = (known after apply)
  + vpc_endpoints             = {
      + ecr_api_endpoint_id         = (known after apply)
      + ecr_dkr_endpoint_id         = (known after apply)
      + endpoints_security_group_id = (known after apply)
      + logs_endpoint_id            = (known after apply)
    }
  + vpc_endpoints_dns_names   = {
      + ecr_api_dns = (known after apply)
      + ecr_dkr_dns = (known after apply)
      + logs_dns    = (known after apply)
    }
  + vpc_id                    = "vpc-03fcb436542154949"

```